Revit 2027 API
BuiltInFailures.RebarFailures.CannotPlaceRebar Property
 Can't find a host for Rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceRebar { get; }
Public Shared ReadOnly Property CannotPlaceRebar As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceRebar {
	FailureDefinitionId^ get ();
}
static member CannotPlaceRebar : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace